In [4]:
!pip install pandas
import pandas as pd

Collecting pandas
  Downloading pandas-2.3.3-cp311-cp311-win_amd64.whl (11.3 MB)
     --------------------------------------- 11.3/11.3 MB 16.8 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.23.2 in d:\ml_learning\prime_batch\ml\venv\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\ml_learning\prime_batch\ml\venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1
  Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Requirement already satisfied: tzdata>=2022.7 in d:\ml_learning\prime_batch\ml\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in d:\ml_learning\prime_batch\ml\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Installing collected packages: pytz, pandas
Successfully installed pandas-2.3.3 pytz-2025.2

[notice] A new release of pip available: 22.3 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [5]:
info = {
    "Name": ["Rahul","Harshita","Rakesh"],
    "CGPA": [9.5,7.5,8.5]
}
df = pd.DataFrame(info)

In [6]:
df

       Name  CGPA
0     Rahul   9.5
1  Harshita   7.5
2    Rakesh   8.5

In [10]:
s = pd.Series([23,24,25],index=["Adam","Eve","Hari"])
print(s)
print(s["Adam"])

Adam    23
Eve     24
Hari    25
dtype: int64
23

In [14]:
#panda series are homogeneous (same data type only stores..)
s1 = pd.Series([1,2,3])
s2 = pd.Series([10,20])  #vectorized Operations

print(s1+s2)

s2[2] = 30  #panda series are mutable but size is not mutable..
print(s2)

new_s2 = s2.drop(0)
print(new_s2)

#series handles missing values with nan

0    11.0
1    22.0
2     NaN
dtype: float64
0    10
1    20
2    30
dtype: int64
1    20
2    30
dtype: int64

In [41]:
#dataframes
info = {
    "Name": ["Rahul","Harshita","Rakesh"],
    "CGPA": [9.5,7.5,8.5]
}

n_info = pd.DataFrame([['Rahul',9.53],['Harsh',3.3]], columns = ['Name','Age'])
print(n_info)

df = pd.DataFrame(info)
df
print(type(df))
print(df.index)
print(df.columns)

    Name   Age
0  Rahul  9.53
1  Harsh  3.30
<class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'CGPA'], dtype='object')

KeyError: 'cols'

In [22]:
import numpy as np

np_arr = np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(np_arr, columns = ['A','B','C'])
df

   A  B  C
0  1  2  3
1  4  5  6

In [25]:
df1 = pd.read_csv('raw_data.csv')
df1

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [26]:
df2 = pd.read_json('raw_data.json')
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6                45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0             Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA           58000.0

In [27]:
df2.head()

   id          name   age country   gender   income
0   1      John Doe  29.0     USA     Male  55000.0
1   1      John Doe  29.0     USA     Male  55000.0
2   2    Jane Smith   NaN  Canada   Female  62000.0
3   3          Alex   NaN     USA  Unknown  47000.0
4   4  Maria Garcia  34.0   Spain   Female      NaN

In [28]:
df2.head(3)

   id        name   age country  gender   income
0   1    John Doe  29.0     USA    Male  55000.0
1   1    John Doe  29.0     USA    Male  55000.0
2   2  Jane Smith   NaN  Canada  Female  62000.0

In [30]:
df2.tail()

    id         name   age country  gender   income
6    6               45.0   India  Female  73000.0
7    7   Ahmed Khan  38.0            Male  68000.0
8    8   Rachel Lee  29.0     USA  Female  62000.0
9    9  Carlos Ruiz   NaN  Mexico    Male  45000.0
10  10  Emily Davis  31.0     USA          58000.0

In [32]:
df2.sample()

   id          name   age country  gender  income
4   4  Maria Garcia  34.0   Spain  Female     NaN

In [34]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       11 non-null     int64
 1   name     11 non-null     object
 2   age      8 non-null      float64
 3   country  11 non-null     object
 4   gender   11 non-null     object
 5   income   10 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 656.0+ bytes

In [35]:
df2.describe()

              id        age        income
count  11.000000   8.000000     10.000000
mean    5.090909  32.750000  57600.000000
std     3.176619   6.065123   8896.940798
min     1.000000  27.000000  45000.000000
25%     2.500000  29.000000  52000.000000
50%     5.000000  30.000000  56500.000000
75%     7.500000  35.000000  62000.000000
max    10.000000  45.000000  73000.000000

In [37]:
df2.columns

Index(['id', 'name', 'age', 'country', 'gender', 'income'], dtype='object')

In [38]:
df2.nunique()

id         10
name       10
age         6
country     7
gender      4
income      8
dtype: int64

In [40]:
arr = np.array([1,2,3])
print(type(arr), arr.dtype)

<class 'numpy.ndarray'> int64